РасширениеГТС/Джитиис/DataProcessors/ПечатьЭтикетокИЦенников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПечатьЭтикетокИЦенников</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

РасширениеГТС/Джитиис/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютнаяОтгрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютныйСчетВРубли</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВариантОбеспечения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

РасширениеГТС/Джитиис/DataProcessors/ПечатьЭтикетокИЦенников/Forms/ФормаТовары/Ext/Form/Module.bsl
&НаСервере
&ИзменениеИКонтроль("УстановитьУсловноеОформление")
Процедура асп_УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
#Вставка
// Здесь можно описать новое поведение.
	//+++ ASP_Мочалина 000023656  //ASP_Crow 20.03.2025 000023395 В расширение

	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыВариантКомплекта.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.НазначениеКомплект");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Истина); 



	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыВариантКомплекта.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.НазначениеКомплект");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);           
	
	ASP_ДобавитьЭлементыЗаказаКлиента();
	//+++ ASP_Мочалина 000023656 

#КонецВставки

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКоличествоЭтикеток.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ШаблонЭтикетки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.LightGray);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКоличествоЦенников.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ШаблонЦенника");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.LightGray);

	//

	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКоличествоЦенников.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Выбран");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоЦенников");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыШаблонЦенника.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Выбран");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ШаблонЦенника");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКоличествоЭтикеток.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Выбран");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоЭтикеток");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыШаблонЭтикетки.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Выбран");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ШаблонЭтикетки");

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыШаблонЭтикеткиПриИзменении")
Процедура асп_ТоварыШаблонЭтикеткиПриИзменении(Элемент)
	ОбновитьВидимостьЗависимыхОтШаблонаПолей(); 

#Вставка
// Здесь можно описать новое поведение.
	//+++ ASP_Мочалина 000023656    //ASP_Crow 20.03.2025 000023395 В расширение
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.НазначениеКомплект = Назначение(Элемент.ТекстРедактирования); 
	ТекДанные.ВариантКомплекта = НЕопределено;
	Если ТекДанные.НазначениеКомплект Тогда
		ТекстСообщения = НСтр("ru = 'Заполите Вариант комплекта'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
	КонецЕсли; 
	//--- ASP_Мочалина 000023656 

#КонецВставки
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыНоменклатураПриИзменении")
Процедура асп_ТоварыНоменклатураПриИзменении(Элемент)

	ТекущиеДанные = Новый Структура("Номенклатура, Характеристика, Серия, Упаковка");
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Элементы.Товары.ТекущиеДанные);
	ЗаполнитьЗначенияСвойств(Элементы.Товары.ТекущиеДанные, ПриИзмененииНоменклатуры(ТекущиеДанные)); 
#Вставка
// Здесь можно описать новое поведение.
	//+++ ASP_Мочалина 000023656 //ASP_Crow 20.03.2025 000023395 В расширение
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.НазначениеКомплект = Назначение(ТекДанные.ШаблонЭтикетки); 
	ТекДанные.ВариантКомплекта = НЕопределено;
	//--- ASP_Мочалина 000023656 

#КонецВставки

КонецПроцедуры


&НаСервере
Процедура ASP_ДобавитьЭлементыЗаказаКлиента()
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы(
			"ЗаказКлиента",
			Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"),
			"",
			НСтр("ru = 'Заказ клиента'")));
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ПолеЗаказа = Элементы.Добавить(
		"ЗаказКлиента",
		Тип("ПолеФормы"),
		Элементы.ГруппаШапка);
	
	ПолеЗаказа.Вид = ВидПоляФормы.ПолеВвода;
	ПолеЗаказа.ПутьКДанным = "ЗаказКлиента";
	ПолеЗаказа.Заголовок = НСтр("ru = 'Заказ клиента'");
	
	КомандаЗаполнения = Команды.Добавить("ЗаполнитьПоЗаказуКлиента");
	КомандаЗаполнения.Заголовок = НСтр("ru = 'Заполнить по заказу'");
	КомандаЗаполнения.Действие = "ЗаполнитьПоЗаказуКлиента";
	КомандаЗаполнения.ИзменяетСохраняемыеДанные = Истина;
	КомандаЗаполнения.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	КнопкаЗаполнения = Элементы.Добавить(
		"ЗаполнитьПоЗаказуКлиента",
		Тип("КнопкаФормы"),
		Элементы.ТоварыКоманднаяПанель);
	
	КнопкаЗаполнения.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	КнопкаЗаполнения.ИмяКоманды = "ЗаполнитьПоЗаказуКлиента";
	
КонецПроцедуры             

&НаКлиенте
Процедура ЗаполнитьПоЗаказуКлиента(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма["ЗаказКлиента"]) Тогда
		ПоказатьПредупреждение(
			Неопределено,
			НСтр("ru = 'Выберите заказ клиента.'"));
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	КоличествоСтрок = ЗаполнитьПоЗаказуКлиентаНаСервере();
	
	Если КоличествоСтрок = 0 Тогда
		ПоказатьПредупреждение(
			Неопределено,
			НСтр("ru = 'В выбранном заказе клиента отсутствуют товары с ненулевым количеством.'"));
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ЗаполнитьПоЗаказуКлиентаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыЗаказа.Номенклатура КАК Номенклатура,
	|	ТоварыЗаказа.Характеристика КАК Характеристика,
	|	ТоварыЗаказа.Упаковка КАК Упаковка,
	|	СУММА(ТоварыЗаказа.КоличествоУпаковок) КАК Количество
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ТоварыЗаказа
	|ГДЕ
	|	ТоварыЗаказа.Ссылка = &ЗаказКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыЗаказа.Номенклатура,
	|	ТоварыЗаказа.Характеристика,
	|	ТоварыЗаказа.Упаковка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТоварыЗаказа.КоличествоУпаковок) > 0";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ЭтаФорма["ЗаказКлиента"]);
	
	ТаблицаТоваровЗаказа = Запрос.Выполнить().Выгрузить();
	
	// Полностью удаляем прежние исходные и сформированные строки.
	Объект.ИсходныеДанныеТовары.Очистить();
	Объект.Товары.Очистить();
	
	Если ТаблицаТоваровЗаказа.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Объект.ИсходныеДанныеТовары.Загрузить(ТаблицаТоваровЗаказа);
	
	// Устанавливаем количество ценников и этикеток по количеству из заказа.
	ЗаполнитьКоличествоЭтикетокПоДокументу = Истина;
	ЗаполнитьКоличествоЭтикетокПоОстаткамНаСкладе = Ложь;
	ЗаполнитьКоличествоЦенниковПоДокументу = Истина;
	ЗаполнитьКоличествоЦенниковПоОстаткамНаСкладе = Ложь;
	
	// Штатный механизм заполнит Товары, цены, шаблоны и штрихкоды.
	ЗаполнитьТаблицуТоваровНаСервере(Ложь);
	
	Возврат Объект.Товары.Количество();
	
КонецФункции
